#通过序列操作

#1.切片
a="helloworld"
print(a[0])
print(a[1])
print(a[2])

print(a[-1])
print(a[-3])
print("======================================")

#2.分片:根据索引，第一个数：从索引几开始。第二个数：从索引几结果（包左不包右）第三个数：步长（复数代表反方向截取）
a="0123456789"
print(a[0:5:2])
print(a[5::-2])
print(a[2::2])
print("=======================================")

#3.序列相加:不同类型的不能相加，如str+list
x=[1,23,34]
y=[4,6,8]
c="hello"
print(x+y)
#print(x+c)#报错，str + list不能相加
print("=========================================")

#4.乘法：赋值几次
x=[1,2,3]
y=[4,5,6]
c=7
print(x*c)
print(y*7)
print("==========================================")

#5.成员资格:in,not in 返回True/False
a=[1,2,3,4,5,5,6,6,4,2]
b="helloworld"
print(1 not in a) #False
print("ll" in b)    #Ture
print("==========================================")